from flask import Flask, request, render_template, jsonify, redirect
from flask_cors import *
# import pymysql
import json
import copy
import numpy as np

# 指定静态文件目录
app = Flask(__name__,static_url_path='/static/',template_folder='templates')
# 允许跨域访问
CORS(app, resources=r'/*')

# GET
# -------------------------------------------------------------------------------------------------



# 页面路由
# -------------------------------------------------------------------------------------------------

# 主页
@app.route('/')
def index():
    '''
    主页
    '''
    # 提供搜索框，简洁一点，可加logo...
    hello = "test"
    return render_template("index.html", hello = hello)

# 新闻内容页
@app.route('/news=<DocID>')
def direct_to_news_page(DocID):
    '''
    新闻内容详细页面
    '''
    content = get_content_by_id(DocID)

    return str(DocID)

# 搜索结果页
@app.route('/search=<search_exp>')
def direct_to_search_page(search_exp):
    '''
    搜索结果详细页面
    '''
    # 进行布尔检索
    # 对检索结果排序
    # 查询部分详细信息：生成文档路由 + 前65字表述 + ...
    # 搜索结果分页
    result_data = [['文档7',
  'http://localhost:5000/news=7',
  '本报记者王珍发自广州河北沧州献县的家电经销商王凤恩，2005年年中将自己的小店改为“幸福树电器连锁店”。“大卖场步步紧逼，员工素质低，信息闭']]
#  ['文档1040',
#   'http://localhost:5000/news=1040',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档17',
#   'http://localhost:5000/news=17',
#   '本报记者边长勇发自北京谈论起董事会话题，ColinB.Carter滔滔不绝，作为波士顿咨询的公司治理议题资深专家，ColinB.Carter'],
#  ['文档1043',
#   'http://localhost:5000/news=1043',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档1044',
#   'http://localhost:5000/news=1044',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档21',
#   'http://localhost:5000/news=21',
#   '继上月永乐与大中两巨头宣布开始为期一年的合并计划后，又一个行业并购案也处于进行之中。昨天记者获悉，全球最大家电连锁巨头美国百思买将以1.2亿'],
#  ['文档1046',
#   'http://localhost:5000/news=1046',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档1047',
#   'http://localhost:5000/news=1047',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档536',
#   'http://localhost:5000/news=536',
#   '乳品企业三缄其口本报记者郭艾琳发自上海在乳品企业中闹得沸沸扬扬的牛奶“禁鲜令”注定不得安宁，先由去年10月1日推迟到今年6月1日实行,而今,'],
#  ['文档1048',
#   'http://localhost:5000/news=1048',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档1049',
#   'http://localhost:5000/news=1049',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档1050',
#   'http://localhost:5000/news=1050',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种'],
#  ['文档1051',
#   'http://localhost:5000/news=1051',
#   'G捷利(行情,论坛)(000996)：中国物流领域的黑马连续的拉升和成交天量，个股的大面积崛起，正在逐步印证着牛市已经扑面而来，追逐强势品种']
# ]

    return render_template("search.html", result_data = result_data)

# 功能函数
# -------------------------------------------------------------------------------------------------
def get_content_by_id(DocID):
    '''
    按DocID返回文档内容
    '''

    return 'content'


if __name__ == '__main__':
    app.debug=True  # 默认开启debug模式
    # host=0.0.0.0 port=5000
    app.run('0.0.0.0', 5000)